doc/intro.md

# Table of Contents

1.  [Introduction to algotrd](#org95e3301)
2.  [Libraries](#org5a0763b)
    1.  [oandpts.clj](#org4b54cba)
    2.  [lyzer.clj](#org8c76513)
3.  [Programs](#org797f2d3)
    1.  [nuen.clj](#orgef68b74)
4.  [zz](#org163fad8)



<a id="org95e3301"></a>

# Introduction to algotrd

algotrd provides library functions for

-   the oanda endpts mechanism (oandpts.clj)
-   the analyses of truefx and other data (lyzer.clj)

it makes extensive use of techascent through tablecloth.

programs use these libraries for specific purposes:

-   nuen.clj places trades based on nu patterns


<a id="org5a0763b"></a>

# Libraries


<a id="org4b54cba"></a>

## oandpts.clj

these are the endpts provided by oanda's api


<a id="org8c76513"></a>

## lyzer.clj

contains various routines for analyzing dohlc data


<a id="org797f2d3"></a>

# Programs


<a id="orgef68b74"></a>

## nuen.clj

uses nu patterns to place trades


<a id="org163fad8"></a>

# zz

TODO: write [great documentation](<http://jacobian.org/writing/what-to-write/>)

